// ------------------------------ 1️⃣ السؤال الأول ------------------------------
//     - driving اسمها function عرف دالة او
//     - تأخذ عمر شخص (رقم) واذا كان اكبر من 18 تطبع
//          🚘😍 مبروك سوف تحصل على الليسن
//     - واذا كان اقل من 18 يطبع
//          😢 للاسف عمرك لا يسمح
//     console.log ، if ملاحظة: سوف تستخدم

// 👇 هنا function عرف الدالة او

function driving(age) {
if (age>=18)  { console.log("🚘😍 مبروك سوف تحصل على الليسن")
}
else if (age<18) { console.log("😢 للاسف عمرك لا يسمح")
}
}

driving()
// لا تنسى أن تنادي الدالة



// ------------------------------ 2️⃣ السؤال الثاني ------------------------------
// 2️⃣ السؤال الثاني
//     - iceCream واجعل اسمها array عرف مصفوفة او
//     - 🍦 احفظ فيها مجموعة من نكهات الآيس كريم
//     - console.log لطباعة قائمة نكهات الآيس كريم بإستخدام for loop استخدم

// 👇 هنا array عرف المصفوفة او


let icecream = [`vanilla`, `chocolate`, `strawberry`, `mango`];

function myIceCream(){
for (let y of icecream) {
    console.log(y)

}
}
myIceCream()


// --------------------------------- ✨ بونص ------------------------------------
// بحيث عند مناداة الدالة تطبع القائمة myIceCream بإسم function عرف دالة او
// for loop عرف مصفوفة أخرى تحتوي على أفلامك الكرتون المفضلة بالنسبة لك وقم بطباعة الأفلام بإستخدام

let shows = [`Smurfs`, `Trolls`,`SpongeBob`]
for (let s = 0; s < shows.length; s++) {

console.log(shows[s])    
}

// --------------------------------- 🔥 بونص ------------------------------------
// while loop اطبع احد المصفوفات بإستخدام

let counter=0;
while(counter<shows.length){
    console.log(shows[counter]);
    counter++;

}




